refactor mermaid to plantuml
